# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:

* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM ERD

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='https://curriculum-content.s3.amazonaws.com/data-science/images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')

## Select the names of all employees in Boston 

Hint: join the employees and offices tables. Select the first and last name.

In [2]:
q = """
SELECT employees.firstName, employees.lastName
  FROM employees
       JOIN offices
       ON employees.officeCode = offices.officeCode
    WHERE
           offices.city = 'Boston';
"""
pd.read_sql(q, conn)

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by. Select the office code, city, and number of employees.

In [3]:
q = """
SELECT offices.officeCode, offices.city, offices.country
    FROM offices
    LEFT JOIN employees
       ON offices.officeCode = employees.officeCode
    WHERE
    employees.employeeNumber IS NULL;
"""
pd.read_sql(q, conn)

   officeCode    city country
0          27  Boston     USA

## Write 3 questions of your own and answer them

In [4]:
# Answers will vary

# Example question: 
"""
How many customers are there per office?
"""

'\nHow many customers are there per office?\n'

In [5]:
"""
Question 1
"""

# Your code here

'\nQuestion 1\n'

In [6]:
"""
Question 2
"""

# Your code here

'\nQuestion 2\n'

In [7]:
"""
Question 3
"""

# Your code here

'\nQuestion 3\n'

## Level Up 1: Display the names of every individual product that each employee has sold

Hint: You will need to use multiple `JOIN` clauses to connect all the way from employee names to product names.

In [9]:
q = """
SELECT employees.firstName, employees.lastName, products.productName
    FROM employees
        JOIN customers
        ON employees.employeeNumber = customers.salesRepEmployeeNumber
            JOIN orders
            ON customers.customerNumber = orders.customerNumber
                 JOIN orderdetails
                 ON orders.orderNumber = orderdetails.orderNumber
                     JOIN products
                     ON orderdetails.productCode = products.productCode;
"""
pd.read_sql(q, conn)

     firstName  lastName                                  productName
0       Leslie  Jennings                               1958 Setra Bus
1       Leslie  Jennings                       1940 Ford Pickup Truck
2       Leslie  Jennings                      1939 Cadillac Limousine
3       Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4       Leslie  Jennings                            1968 Ford Mustang
...        ...       ...                                          ...
2991    Martin    Gerard                  1954 Greyhound Scenicruiser
2992    Martin    Gerard       1950's Chicago Surface Lines Streetcar
2993    Martin    Gerard             Diamond T620 Semi-Skirted Tanker
2994    Martin    Gerard                           1911 Ford Town Car
2995    Martin    Gerard             1936 Mercedes Benz 500k Roadster

[2996 rows x 3 columns]

## Level Up 2: Display the number of products each employee has sold

Alphabetize the results by employee last name.

Hint: Use the `quantityOrdered` column from `orderDetails`. Also, think about how to group the data when some employees might have the same first or last name.

In [19]:
q = """
SELECT employees.lastName, SUM(orderDetails.quantityOrdered) AS 'num_of_products_sold'
    FROM employees
        JOIN customers
        ON employees.employeeNumber = customers.salesRepEmployeeNumber
            JOIN orders
            ON customers.customerNumber = orders.customerNumber
                 JOIN orderdetails
                 ON orders.orderNumber = orderdetails.orderNumber
GROUP BY
    employees.employeeNumber
ORDER BY
    employees.lastName;
"""
pd.read_sql(q, conn)

     lastName  num_of_products_sold
0      Bondur                  6186
1        Bott                  8205
2    Castillo                  9290
3    Firrelli                  4227
4      Fixter                  6246
5      Gerard                  4180
6   Hernandez                 14231
7    Jennings                 11854
8       Jones                  7486
9       Marsh                  6632
10      Nishi                  4923
11  Patterson                  5561
12   Thompson                  4056
13      Tseng                  5016
14     Vanauf                  7423

## Level Up 3: Display the names employees who have sold more than 200 different products

Hint: this is different from the previous question because the quantity sold doesn't matter, only the number of different products

In [17]:
q = """
SELECT employees.lastName, COUNT(products.productName) AS 'num_of_different_products_sold'
    FROM employees
        JOIN customers
        ON employees.employeeNumber = customers.salesRepEmployeeNumber
            JOIN orders
            ON customers.customerNumber = orders.customerNumber
                 JOIN orderdetails
                 ON orders.orderNumber = orderdetails.orderNumber
                     JOIN products
                     ON orderdetails.productCode = products.productCode
GROUP BY
    employees.employeeNumber
HAVING
    num_of_different_products_sold > 200
ORDER BY
    employees.lastName;
"""
pd.read_sql(q, conn)

    lastName  num_of_different_products_sold
0       Bott                             236
1   Castillo                             272
2  Hernandez                             396
3   Jennings                             331
4      Jones                             220
5     Vanauf                             211

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!